<a href="https://colab.research.google.com/github/mohit266/ML-/blob/master/27june02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
list=[1,2,3,4]
df = pd.DataFrame(list)

In [6]:
df

   0
0  1
1  2
2  3
3  4

In [0]:
list1=[3,4,5,6]
df=pd.DataFrame([list,list1],columns=['age','value','name','marks'])

In [8]:
df

   age  value  name  marks
0    1      2     3      4
1    3      4     5      6

In [0]:
list=["David",18,90]
list1=["Mohit",19,80]
list2=["Ankit",18,78]
df=pd.DataFrame([list,list1,list2],columns=['Name','age','Marks'])

In [25]:
df

    Name  age  Marks
0  David   18     90
1  Mohit   19     80
2  Ankit   18     78